Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/ТекстовыйБлок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПриСозданииНаСервере(ЭтаФорма);
	Заголовок = Параметры.ВидЭлемента;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Элементы.ТолькоДляПечати.Видимость = Параметры.Свойство("ИспользоватьДляВводаПлана") 
		И Параметры.ИспользоватьДляВводаПлана;
	
	ПараметрыПодстановки = ПолучитьПараметрыПодстановкиОтчета();
	Если ЗначениеЗаполнено(Параметры.МодельБюджетирования) Тогда
		ДобавитьПараметрыПодстановкиПоВидуБюджета(ПараметрыПодстановки);
	КонецЕсли;
	ДобавитьКомандыПараметровПодстановки(ПараметрыПодстановки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйБлокПриИзменении(Элемент)
	
	Объект.НаименованиеДляПечати = СокрЛП(СтрПолучитьСтроку(Текст, 1));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ДополнительныеСвойства = Новый Структура("ПредставлениеТолькоДляПечати");
	ДополнительныеСвойства.ПредставлениеТолькоДляПечати = ?(ТолькоДляПечати, 
							НСтр("ru = 'Не выводится при заполнении бюджета'"), "");
	
	ФинансоваяОтчетностьКлиент.ЗавершитьРедактированиеЭлементаОтчета(ЭтаФорма, ДополнительныеСвойства);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКомандыПараметровПодстановки(ПараметрыПодстановки)
	
	ИмяДействияКоманды = "ДобавитьШаблонПодстановки";
	
	Для НомерПараметра = 1 По ПараметрыПодстановки.Количество() Цикл
		
		ИмяПараметраШаблона = "ДобавитьШаблон"+НомерПараметра;
		
		КомандаФормы = ЭтаФорма.Команды.Добавить(ИмяПараметраШаблона);
		КомандаФормы.Действие = ИмяДействияКоманды;
		
		НоваяКнопкаФормы = Элементы.Добавить(ИмяПараметраШаблона, Тип("КнопкаФормы"), Элементы.ДобавитьПараметр);
		НоваяКнопкаФормы.Заголовок = ПараметрыПодстановки[НомерПараметра-1];
		НоваяКнопкаФормы.ИмяКоманды = ИмяПараметраШаблона;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПараметрыПодстановкиОтчета()
	
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить(НСтр("ru = 'Вид отчета'"));
	МассивПараметров.Добавить(НСтр("ru = 'Текущая дата и время'"));
	МассивПараметров.Добавить(НСтр("ru = 'Период отчетности'"));
	МассивПараметров.Добавить(НСтр("ru = 'Конечная дата периода отчета'"));
	// Однотипные параметры добавляемые в бюджетном отчете по своим правилам
	Если НЕ ЗначениеЗаполнено(Параметры.МодельБюджетирования) Тогда
		МассивПараметров.Добавить(НСтр("ru = 'Организация'"));
	КонецЕсли;
	
	Возврат МассивПараметров;
	
КонецФункции

&НаСервере
Функция ДобавитьПараметрыПодстановкиПоВидуБюджета(МассивПараметров)
	
	МассивПараметров.Добавить(НСтр("ru = 'Сценарий'"));
	
	МодельБюджетирования = Параметры.МодельБюджетирования;
	
	Если ЗначениеЗаполнено(МодельБюджетирования) Тогда
		РеквизитыМоделиБюджетирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.МодельБюджетирования,
			Новый Структура("БюджетыПоОрганизациям,БюджетыПоПодразделениям"));
			
		Если РеквизитыМоделиБюджетирования.БюджетыПоОрганизациям Тогда
			МассивПараметров.Добавить(НСтр("ru = 'Организация'"));
		КонецЕсли;
		
		Если РеквизитыМоделиБюджетирования.БюджетыПоПодразделениям Тогда
			МассивПараметров.Добавить("Подразделение");
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьДляВводаПлана = Параметры.Свойство("ИспользоватьДляВводаПлана") И Параметры.ИспользоватьДляВводаПлана;
	Если ИспользоватьДляВводаПлана Тогда
		МассивПараметров.Добавить(НСтр("ru = 'Статус документа'"));
		МассивПараметров.Добавить(НСтр("ru = 'Ответственный'"));
	КонецЕсли;
	
	Если Параметры.Свойство("АдресСпискаАналитик") Тогда
		ТаблицаАналитикШапки = ПолучитьИзВременногоХранилища(Параметры.АдресСпискаАналитик);
		Для Каждого СтрокаТаблицы Из ТаблицаАналитикШапки Цикл
			МассивПараметров.Добавить(СтрокаТаблицы.ВидАналитики);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивПараметров;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьШаблонПодстановки(Команда)
	 
	ТекстДляВставки = "["+ Элементы[Команда.Имя].Заголовок +"]";
	ВставитьТекстВЗаголовок(ТекстДляВставки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстВЗаголовок(ТекстДляВставки, Сдвиг = 0)
	
	СтрокаНач = 0;
	СтрокаКон = 0;
	КолонкаНач = 0;
	КолонкаКон = 0;
	
	Элементы.ТекстовыйБлок.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	Если (КолонкаКон = КолонкаНач) И (КолонкаКон + СтрДлина(ТекстДляВставки)) > Элементы.ТекстовыйБлок.Ширина / 8 Тогда
		Элементы.ТекстовыйБлок.ВыделенныйТекст = "";
	КонецЕсли;
	
	Элементы.ТекстовыйБлок.ВыделенныйТекст = ТекстДляВставки;
	
	Если Не Сдвиг = 0 Тогда
		Элементы.ТекстовыйБлок.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
		Элементы.ТекстовыйБлок.УстановитьГраницыВыделения(СтрокаНач, КолонкаНач - Сдвиг, СтрокаКон, КолонкаКон - Сдвиг);
	КонецЕсли;
	ТекущийЭлемент = Элементы.ТекстовыйБлок;
	
КонецПроцедуры

#КонецОбласти
